<?xml version="1.0" ?>
<net batch="1" name="hg_s2_tiny" version="5">
	<layers>
		<layer id="0" name="input_1" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_1/convolution" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>190</dim>
					<dim>126</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="144"/>
				<biases offset="144" size="16"/>
			</blobs>
		</layer>
		<layer id="2" name="activation_1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>190</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>190</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2d_2/convolution" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>190</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="160" size="1152"/>
				<biases offset="1312" size="16"/>
			</blobs>
		</layer>
		<layer id="4" name="activation_2/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="separable_conv2d_1/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1328" size="144"/>
			</blobs>
		</layer>
		<layer id="6" name="separable_conv2d_1/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1472" size="256"/>
				<biases offset="1728" size="32"/>
			</blobs>
		</layer>
		<layer id="7" name="activation_3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="separable_conv2d_2/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1760" size="288"/>
			</blobs>
		</layer>
		<layer id="9" name="separable_conv2d_2/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2048" size="512"/>
				<biases offset="2560" size="32"/>
			</blobs>
		</layer>
		<layer id="10" name="max_pooling2d_1/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2d_3/convolution" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>188</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2592" size="256"/>
				<biases offset="2848" size="32"/>
			</blobs>
		</layer>
		<layer id="12" name="add_1/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="separable_conv2d_3/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2880" size="288"/>
			</blobs>
		</layer>
		<layer id="14" name="separable_conv2d_3/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3168" size="1024"/>
				<biases offset="4192" size="64"/>
			</blobs>
		</layer>
		<layer id="15" name="activation_4/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="separable_conv2d_4/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4256" size="576"/>
			</blobs>
		</layer>
		<layer id="17" name="separable_conv2d_4/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4832" size="2048"/>
				<biases offset="6880" size="64"/>
			</blobs>
		</layer>
		<layer id="18" name="max_pooling2d_2/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv2d_4/convolution" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>94</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6944" size="1024"/>
				<biases offset="7968" size="64"/>
			</blobs>
		</layer>
		<layer id="20" name="add_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="separable_conv2d_5/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8032" size="576"/>
			</blobs>
		</layer>
		<layer id="22" name="separable_conv2d_5/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8608" size="4096"/>
				<biases offset="12704" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="activation_5/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="separable_conv2d_6/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12832" size="1152"/>
			</blobs>
		</layer>
		<layer id="25" name="separable_conv2d_6/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13984" size="8192"/>
				<biases offset="22176" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="max_pooling2d_3/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2d_5/convolution" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>31</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="22304" size="4096"/>
				<biases offset="26400" size="128"/>
			</blobs>
		</layer>
		<layer id="28" name="add_3/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="separable_conv2d_7/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26528" size="1152"/>
			</blobs>
		</layer>
		<layer id="30" name="separable_conv2d_7/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="27680" size="16384"/>
				<biases offset="44064" size="256"/>
			</blobs>
		</layer>
		<layer id="31" name="activation_6/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="separable_conv2d_8/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="128" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="44320" size="2304"/>
			</blobs>
		</layer>
		<layer id="33" name="separable_conv2d_8/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="46624" size="32768"/>
				<biases offset="79392" size="256"/>
			</blobs>
		</layer>
		<layer id="34" name="max_pooling2d_4/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2d_6/convolution" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="79648" size="16384"/>
				<biases offset="96032" size="256"/>
			</blobs>
		</layer>
		<layer id="36" name="add_4/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv2d_7/convolution" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="7" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>7</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<weights offset="96288" size="16128"/>
				<biases offset="112416" size="14"/>
			</blobs>
		</layer>
		<layer id="38" name="global_average_pooling2d_1/Mean" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="12,8" pads_begin="0,0" pads_end="0,0" pool-method="avg" rounding-type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>12</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_/DimData_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="112430" size="4"/>
			</blobs>
		</layer>
		<layer id="40" name="Reshape_" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="predictions/Softmax" precision="FP16" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
		<edge from-layer="12" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="3" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="3" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="20" from-port="2" to-layer="27" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="3" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="3" to-layer="31" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="3" to-layer="34" to-port="0"/>
		<edge from-layer="28" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="35" from-port="3" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="3" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="40" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="41" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.1.1-83-g28dfbfd"/>
		<cli_parameters>
			<data_type value="FP16"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/tf_model.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,192,128,3]"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="hg_s2_tiny"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[  1 192 128   3]"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_checkpoint, input_meta_graph, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
